
## Plan Result (stg)




<pre><code>Plan: 1 to add, 5 to change, 0 to destroy.</code></pre>

* Create
  * module.sa.azurerm_private_endpoint.this[0]
* Update
  * azurerm_eventgrid_topic.mig-scanner[0]
  * azurerm_log_analytics_workspace.migration-analytics[0]
  * azurerm_monitor_action_group.blob-action-group[0]
  * azurerm_recovery_services_vault.darts-migration-backup[0]
  * azurerm_windows_virtual_machine.modernisation_windows[&#34;stgdartsmidmock&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_eventgrid_topic.mig-scanner[0] will be updated in-place
  ~ resource "azurerm_eventgrid_topic" "mig-scanner" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.EventGrid/topics/darts-event-stg"
        name                          = "darts-event-stg"
      ~ tags                          = {
          - "application"  = "darts" -> null
          - "builtFrom"    = "https://github.com/HMCTS/darts-shared-infrastructure.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "staging" -> null
        }
        # (9 unchanged attributes hidden)
    }

  # azurerm_log_analytics_workspace.migration-analytics[0] will be updated in-place
  ~ resource "azurerm_log_analytics_workspace" "migration-analytics" {
        id                                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.OperationalInsights/workspaces/darts-migration-analytics-workspace"
        name                                    = "darts-migration-analytics-workspace"
      ~ tags                                    = {
          - "application"  = "darts" -> null
          - "builtFrom"    = "https://github.com/HMCTS/darts-shared-infrastructure.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "staging" -> null
        }
        # (14 unchanged attributes hidden)
    }

  # azurerm_monitor_action_group.blob-action-group[0] will be updated in-place
  ~ resource "azurerm_monitor_action_group" "blob-action-group" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Insights/actionGroups/blob-ingress-action-group"
        name                = "blob-ingress-action-group"
      ~ tags                = {
          - "application"  = "darts" -> null
          - "builtFrom"    = "https://github.com/HMCTS/darts-shared-infrastructure.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "staging" -> null
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_recovery_services_vault.darts-migration-backup[0] will be updated in-place
  ~ resource "azurerm_recovery_services_vault" "darts-migration-backup" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.RecoveryServices/vaults/darts-prod-rsv"
        name                               = "darts-prod-rsv"
      ~ tags                               = {
          - "application"  = "darts" -> null
          - "builtFrom"    = "https://github.com/HMCTS/darts-shared-infrastructure.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "staging" -> null
        }
        # (9 unchanged attributes hidden)
    }

  # azurerm_windows_virtual_machine.modernisation_windows["stgdartsmidmock"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "modernisation_windows" {
        id                                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Compute/virtualMachines/stgdartsmidmock"
        name                                                   = "stgdartsmidmock"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (25 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sa.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dartssastg"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "darts-stg-rg"
      + subnet_id                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/private-endpoints"
      + tags                     = {
          + "application"         = "darts"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#darts-devs"
          + "environment"         = "staging"
          + "managedBy"           = "Darts Modernisation"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dartssastg"
          + private_connection_resource_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Storage/storageAccounts/dartssastg"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

Plan: 1 to add, 5 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":254,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->